"""

███╗░░░███╗░█████╗░░██████╗████████╗███████╗██████╗░███╗░░░███╗██╗███╗░░██╗██████╗░░░░░░░██╗░░░██╗██████╗░████████╗██╗░░██╗
████╗░████║██╔══██╗██╔════╝╚══██╔══╝██╔════╝██╔══██╗████╗░████║██║████╗░██║██╔══██╗░░░░░░██║░░░██║██╔══██╗╚══██╔══╝╚██╗██╔╝
██╔████╔██║███████║╚█████╗░░░░██║░░░█████╗░░██████╔╝██╔████╔██║██║██╔██╗██║██║░░██║█████╗╚██╗░██╔╝██████╔╝░░░██║░░░░╚███╔╝░
██║╚██╔╝██║██╔══██║░╚═══██╗░░░██║░░░██╔══╝░░██╔══██╗██║╚██╔╝██║██║██║╚████║██║░░██║╚════╝░╚████╔╝░██╔══██╗░░░██║░░░░██╔██╗░
██║░╚═╝░██║██║░░██║██████╔╝░░░██║░░░███████╗██║░░██║██║░╚═╝░██║██║██║░╚███║██████╔╝░░░░░░░░╚██╔╝░░██║░░██║░░░██║░░░██╔╝╚██╗
╚═╝░░░░░╚═╝╚═╝░░╚═╝╚═════╝░░░░╚═╝░░░╚══════╝╚═╝░░╚═╝╚═╝░░░░░╚═╝╚═╝╚═╝░░╚══╝╚═════╝░░░░░░░░░░╚═╝░░░╚═╝░░╚═╝░░░╚═╝░░░╚═╝░░╚═╝

"""

from pyrogram import Client, Filters, StopPropagation, InlineKeyboardButton, InlineKeyboardMarkup


@Client.on_message(Filters.command(["youtubelink"]), group=-2)
async def love(client, message):
    # return
    joinButton = InlineKeyboardMarkup([
        [InlineKeyboardButton("⭕ @Cgmoviehub ⭕", url="https://t.me/Cgmoviehub)],
        [InlineKeyboardButton("⚜️ @Calledo_Gaming ⚜️", url="https://t.me/Calledo_Gaming")],
        [InlineKeyboardButton("👾 BotsList 👾", url="https://t.me/calledobotupdates")],
        [InlineKeyboardButton("🧊 Leech & Mirror 🧊", url="https://t.me/Cgmoviehub")],
        [InlineKeyboardButton("⚡️ Movies & Demand ⚡️", url="https://t.me/Cgmoviehub")]
    ])
    youtube_ex = f"""
**Some example youtube channels and songs if you don't know then what u want**
- type /github if I helped u in AnyWay.\n
```Pʀᴇᴅ∆ᴛᴏʀ``` """

   
    
    await message.reply_text(youtube_ex, reply_markup=joinButton)
    raise StopPropagation






